diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Элементы.Найти("ГруппаПериод") = Неопределено Тогда
		ЭлементГруппаПериод = Элементы.Добавить("ГруппаПериод", Тип("ГруппаФормы"));
		ЭлементГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппаПериод.Заголовок = "Период действия договора";
		ЭлементГруппаПериод.Видимость = Ложь;
	КонецЕсли;
	
	Если Элементы.Найти("ВКМ_ДатаНачала") = Неопределено Тогда			
		ЭлементДатаНачала = Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"), Элементы.ГруппаПериод);
		ЭлементДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаНачала.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
		ЭлементДатаНачала.Заголовок = "С";
		ЭлементДатаНачала.Видимость = Ложь;
	КонецЕсли;
	
	Если Элементы.Найти("ВКМ_ДатаОкончания") = Неопределено Тогда
		ЭлементДатаОкончания = Элементы.Добавить("ВКМ_ДатаОкончания", Тип("ПолеФормы"), Элементы.ГруппаПериод);
		ЭлементДатаОкончания.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаОкончания.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
		ЭлементДатаОкончания.Заголовок = "по";
		ЭлементДатаОкончания.Видимость = Ложь;
	КонецЕсли;

	Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда
		ЭлементСуммаАбонентскойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
		ЭлементСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		ЭлементСуммаАбонентскойПлаты.Заголовок = "Сумма абонентской платы";
		ЭлементСуммаАбонентскойПлаты.Видимость = Ложь;
	КонецЕсли;
	
	Если Элементы.Найти("ВКМ_СтоимостьЧасаРаботы") = Неопределено Тогда	
		ЭлементСтоимостьЧасаРаботы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
		ЭлементСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		ЭлементСтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";
		ЭлементСуммаАбонентскойПлаты.Видимость = Ложь;
	КонецЕсли;
	
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ГруппаПериод.Видимость = Истина;
		Элементы.ВКМ_ДатаНачала.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончания.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;	
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
	КонецЕсли;
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Покупатель Или Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Поставщик Тогда
		Элементы.ГруппаПериод.Видимость = Ложь;
		Элементы.ВКМ_ДатаНачала.Видимость = Ложь;
		Элементы.ВКМ_ДатаОкончания.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;	
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
